{
  "_class_name": "DDIMScheduler",
  "_diffusers_version": "0.15.0.dev0",
  "beta_end": 0.0195,
  "beta_schedule": "scaled_linear",
  "beta_start": 0.0015,
  "clip_sample": false,
  "clip_sample_range": 1.0,
  "dynamic_thresholding_ratio": 0.995,
  "num_train_timesteps": 1000,
  "prediction_type": "epsilon",
  "sample_max_value": 1.0,
  "set_alpha_to_one": false,
  "steps_offset": 1,
  "thresholding": false,
  "trained_betas": null
}
